Revit 2027 API
MEPSystem.IsEmpty Property
 Indicates if the system is empty or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEmpty { get; }
Public ReadOnly Property IsEmpty As Boolean
	Get
public:
property bool IsEmpty {
	bool get ();
}
member IsEmpty : bool with get
Property Value
Boolean
Remarks
 returns true if the system doesn't contain any components
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace